intel_SSDSCKKI51.log
Intel DC S3110 Series 512 GB (SSDSCKKI512G8)
https://ark.intel.com/content/www/us/en/ark/products/129323/intel-ssd-dc-s3110-series-512gb-2-5in-sata-6gb-s-3d2-tlc.html

$ udisksctl  status
MODEL                     REVISION  SERIAL               DEVICE
--------------------------------------------------------------------------
INTEL SSDSCKKI512G8       LHF001D   BTLA82801F9Z512K     sda     

$ sudo lshw -C disk                                                                    
  *-disk                                                                                 
       description: ATA Disk                                                                         
       product: INTEL SSDSCKKI51                                                                     
       physical id: 0.0.0                                                                       
       bus info: scsi@1:0.0.0                                                                      
       logical name: /dev/sda                                                                                                   
       version: 001D                                                                                                              
       serial: BTLA82801F9Z512K                                                                                   
       size: 476GiB (512GB)                                                                                             
       capabilities: gpt-1.00 partitioned partitioned:gpt                                                   
       configuration: ansiversion=5 guid=dd8f185a-1e2f-4f92-a388-850fa05b765b logicalsectorsize=512 sectorsize=512

###########################################################
#
#  Running test='fio-perf-test' job='4k'
#  Results dir: randrw-4k.results
#
###########################################################
4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
fio-3.1
Starting 1 process
4k: Laying out IO files (240 files / total 63616MiB)

4k: (groupid=0, jobs=1): err= 0: pid=5568: Fri Jul 17 07:25:44 2020
   read: IOPS=12.9k, BW=50.3MiB/s (52.7MB/s)(14.7GiB/300006msec)
    slat (usec): min=2, max=84315, avg=15.37, stdev=93.31
    clat (usec): min=48, max=112695, avg=1813.04, stdev=2096.70
     lat (usec): min=89, max=112704, avg=1828.77, stdev=2098.29
    clat percentiles (usec):
     |  1.00th=[  326],  5.00th=[  594], 10.00th=[  725], 20.00th=[  857],
     | 30.00th=[  971], 40.00th=[ 1106], 50.00th=[ 1254], 60.00th=[ 1467],
     | 70.00th=[ 1844], 80.00th=[ 2343], 90.00th=[ 3458], 95.00th=[ 5014],
     | 99.00th=[ 8094], 99.50th=[ 8586], 99.90th=[10159], 99.95th=[11076],
     | 99.99th=[88605]
   bw (  KiB/s): min=  800, max=124000, per=100.00%, avg=54375.51, stdev=22989.18, samples=29611
   iops        : min=  200, max=31000, avg=13595.39, stdev=5747.90, samples=29611
  write: IOPS=12.9k, BW=50.3MiB/s (52.7MB/s)(14.7GiB/300006msec)
    slat (usec): min=3, max=108098, avg=19.60, stdev=110.99
    clat (usec): min=569, max=119119, avg=8089.87, stdev=4764.59
     lat (usec): min=581, max=119146, avg=8109.87, stdev=4766.92
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    7], 60.00th=[    8],
     | 70.00th=[   11], 80.00th=[   12], 90.00th=[   14], 95.00th=[   14],
     | 99.00th=[   17], 99.50th=[   19], 99.90th=[   90], 99.95th=[   94],
     | 99.99th=[  114]
   bw (  KiB/s): min=  400, max=112444, per=100.00%, avg=54403.46, stdev=23212.63, samples=29589
   iops        : min=  100, max=28111, avg=13600.61, stdev=5803.13, samples=29589
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.29%, 500=1.13%, 750=4.36%
  lat (usec)   : 1000=10.32%
  lat (msec)   : 2=20.70%, 4=11.47%, 10=35.73%, 20=15.80%, 50=0.12%
  lat (msec)   : 100=0.07%, 250=0.01%
  cpu          : usr=8.15%, sys=37.84%, ctx=729819, majf=0, minf=11568
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=110.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=3863363,3861976,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=50.3MiB/s (52.7MB/s), 50.3MiB/s-50.3MiB/s (52.7MB/s-52.7MB/s), io=14.7GiB (15.8GB), run=300006-300006msec
  WRITE: bw=50.3MiB/s (52.7MB/s), 50.3MiB/s-50.3MiB/s (52.7MB/s-52.7MB/s), io=14.7GiB (15.8GB), run=300006-300006msec

Disk stats (read/write):
  sda: ios=4263771/4557187, merge=0/707462, ticks=5042396/5026484, in_queue=10064400, util=99.81%

Done.